InformationRegisters/ПеремещенияИгроков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПеремещенияИгроков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Амплуа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Амплуа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТурнирнаяТаблица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ТурнирнаяТаблица</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоГолов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОчков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ПеремещенияИгроков/Ext/RecordSetModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	МАКСИМУМ(ТурнирнаяТаблица.Период) КАК Период
		                      |ИЗ
		                      |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                      |ГДЕ
		                      |	ТурнирнаяТаблица.Тур.ОлимпийскаяСистема = ЛОЖЬ");
		Выборка	= Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Период = Дата(Год(Выборка.Период), ?(Месяц(Выборка.Период)<8, 1, 8), 1);
		Иначе
			Период = Дата(Год(ТекущаяДатаСеанса()), ?(Месяц(ТекущаяДатаСеанса())<8, 1, 8), 1);
		КонецЕсли;
		
		Для Каждого Запись Из ЭтотОбъект Цикл
			Запись.Период = Период;
			Если ТипЗнч(ДанныеЗаполнения.Свойство("Игрок")) = Тип("СправочникСсылка.Игроки")
			И ЗначениеЗаполнено(ДанныеЗаполнения.Игрок.Амплуа)
			Тогда
				Запись.Амплуа	= ДанныеЗаполнения.Игрок.Амплуа;
			КонецЕсли;
			Если ТипЗнч(ДанныеЗаполнения.Свойство("Команда")) = Тип("СправочникСсылка.Команды")
			И ЗначениеЗаполнено(ДанныеЗаполнения.Команда)
			Тогда
				Запись.Команда	= ДанныеЗаполнения.Команда;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	Если Замещение Тогда Возврат; КонецЕсли;
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(Запись.Амплуа)
		И НЕ ЗначениеЗаполнено(Запись.Игрок.Амплуа)
		Тогда
			тОбъект = Запись.Игрок.ПолучитьОбъект();
			тОбъект.Амплуа	= Запись.Амплуа;
			тОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	Если Замещение Тогда Возврат; КонецЕсли;
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(Запись.Команда) И Запись.Номер > 0 Тогда
			Запись.Номер = 0;
		КонецЕсли;
		Запись.Комментарий	= СокрЛП(Лев(Запись.Комментарий, 10000));
	КонецЦикла;
КонецПроцедуры
